{
  "blank": {
    "message": ""
  },
  "mute_warnings": {
    "message": "Mute future warnings for this domain"
  },
  "daily_quota_usage": {
    "message": "Daily quota usage"
  },
  "hourly_quota_usage": {
    "message": "Hourly quota usage"
  },
  "setup_needed": {
    "message": "Setup Needed"
  },
  "no_api_key": {
    "message": "No API Key found. Please enter your VirusTotal API Key in the setup page."
  },
  "go_to_setup": {
    "message": "Go to Setup"
  },
  "overall_stats": {
    "message": "Overall stats"
  },
  "safe": {
    "message": "Safe"
  },
  "info_safe": {
    "message": "This site is safe to visit."
  },
  "malicious": {
    "message": "Malicious"
  },
  "status_site_not_scanned": {
    "message": "Site not scanned"
  },
  "info_no_active_tab": {
    "message": "Error: No active tab"
  },
  "info_non_http": {
    "message": "This site won't be scanned as only public domains using HTTP or HTTPS protocols eligible for a scan."
  },
  "status_loading": {
    "message": "Loading..."
  },
  "status_warning": {
    "message": "Warning!"
  },
  "info_warning": {
    "message": "$1 engines flagged this site as malicious."
  },
  "total_sites_scanned": {
    "message": "Total Sites Scanned: $1"
  },
  "dangerous_site_detected": {
    "message": "Dangerous Site Detected!"
  },
  "lead_warning": {
    "message": "The site $1 has been flagged as potentially dangerous by multiple sources. Do not reveal any personal information, credit card info, or any other sensitive information. Proceed with caution."
  },
  "info_about_malicious": {
    "message": "Out of $1 engines, $2 have deemed this site to be malicious."
  },
  "note_about_malicious": {
    "message": "Note: The label \"malicious\" is the highest level of certainty that a site might be harmful. Even one engine marking a site as malicious should be enough to raise concerns. Always be cautious and prioritize your online safety."
  },
  "more_options": {
    "message": "More options"
  },
  "mute_domain": {
    "message": "Ignore future warnings for $1"
  },
  "understand_risk": {
    "message": "I understand the risk!"
  },
  "welcome_title": {
    "message": "Welcome!"
  },
  "welcome_heading": {
    "message": "Welcome to ScamAlert!"
  },
  "welcome_description": {
    "message": "This is a simple helper extension that will scan the URLs you visit for any malicious content. It uses VirusTotal API to scan the domains and alerts you when you visit malicious domains."
  },
  "welcome_note": {
    "message": "<b>Note:</b> While this extension uses the VirusTotal API, it is not in any way affiliated with VirusTotal."
  },
  "welcome_instruction": {
    "message": "To begin, click the \"Next\" button below."
  },
  "next": {
    "message": "Next"
  },
  "permissions_title": {
    "message": "Extension permissions"
  },
  "permissions_heading": {
    "message": "Permissions & Privacy"
  },
  "permissions_intro": {
    "message": "This extension requires certain permissions to function properly. These are:"
  },
  "permission_active_tab": {
    "message": "<b>Active Tab:</b> This allows the extension to interact with the current active tab and scan the URLs for potential threats."
  },
  "permission_web_request": {
    "message": "<b>Web Request:</b> This permission lets the extension monitor web requests made by the browser, such as when you navigate to a new URL. This is crucial for determining when to scan a URL."
  },
  "permission_local_storage": {
    "message": "<b>Local Storage Access:</b> This is used to store settings, the API key, and cache scan results for better performance."
  },
  "permission_unlimited_storage": {
    "message": "<b>Unlimited Storage:</b> The extension can store an unlimited amount of data in the browser storage. This ensures that the cached scan results and settings aren't accidentally deleted by the browser when it's freeing up space."
  },
  "permission_alarms": {
    "message": "<b>Alarms:</b> This allows the extension to manage and schedule certain tasks within the extension, like cleanup of old scan data or fetching of analysis results for domains."
  },
  "permission_host_permissions": {
    "message": "<b>Host permissions:</b> This ensures the extension has the ability to scan and analyze content across all websites you visit."
  },
  "permissions_privacy_note": {
    "message": "We only send the domain part of the URL to the VirusTotal API for analysis, and do not share your data with anyone else. Your privacy is our utmost priority."
  },
  "permission_important_note_title": {
    "message": "Important: Enabling 'Access your data for all websites'"
  },
  "permission_important_note_intro": {
    "message": "This extension requires the 'Access your data for all websites' permission to function properly. Without it, the extension cannot operate as intended. Enabling this permission allows the extension to see URLs of the pages you visit, which is necessary for scanning domains."
  },
  "permission_important_note_guide": {
    "message": "Below are the steps to give the permission:"
  },
  "permission_important_note_step1": {
    "message": "Right-click on the extension icon in your browser toolbar."
  },
  "permission_important_note_step2": {
    "message": "Select 'Manage extension' from the context menu that appears."
  },
  "permission_important_note_step3": {
    "message": "In the new page, click on the 'Permission' tab."
  },
  "permission_important_note_step4": {
    "message": "Find the 'Access your data for all websites' permission and enable it by toggling the button next to it."
  },
  "permission_grant_error": {
    "message": "The extension cannot work without the 'Access your data for all websites' permission. Please enable it to continue."
  },
  "why_api_title": {
    "message": "Why Do You Need the VirusTotal API Key?"
  },
  "why_api_header": {
    "message": "Why the API Key?"
  },
  "why_api_description": {
    "message": "To analyze the URLs and ensure your safety, our extension relies on the VirusTotal service..."
  },
  "why_api_free_no_credit_card": {
    "message": "Don't worry, it's totally free, no credit card or any sensitive info required."
  },
  "why_api_steps": {
    "message": "Steps to Get Your API Key"
  },
  "why_api_steps_step1": {
    "message": "Register for a free account on <a href='https://www.virustotal.com/gui/join-us' target='_blank'>VirusTotal</a>."
  },
  "why_api_steps_step2": {
    "message": "Once registered, go to your API key section or use the link <b>www.virustotal.com/gui/user/USERNAME/apikey</b> and replace <b>USERNAME</b> with the username of the VirusTotal account you've registered in the previous step."
  },
  "why_api_steps_step3": {
    "message": "On the VirusTotal page, click the `Copy API key` button to copy the API key to your clipboard. Once you've copied the API key, proceed to the next page by clicking the 'Next' button."
  },
  "why_api_image_guide_intro": {
    "message": "Alternatively, browse for VirusTotal, register for an account, and follow the image guide shown below."
  },
  "why_api_image_guide_header": {
    "message": "Image Guide for API Key Access"
  },
  "why_api_image_guide_img1_desc": {
    "message": "This image guides you to access the API Key section of your VirusTotal account."
  },
  "why_api_image_guide_img2_desc": {
    "message": "This image shows you where to click to copy the API key to your clipboard."
  },
  "why_api_what_is_api_header": {
    "message": "What is an API Key and Why Do You Need It?"
  },
  "why_api_what_is_api_desc": {
    "message": "An API key is like a secret password that allows our extension to talk to VirusTotal's servers. It helps us scan the URLs you visit to check if they are safe or potentially harmful."
  },
  "why_api_why_own_api_key_header": {
    "message": "Why Do You Need Your Own API Key?"
  },
  "why_api_why_own_api_key_desc1": {
    "message": "Each API key has a limited quota for requests to VirusTotal. Sharing a single key between all users would quickly exhaust this limit, making the service unavailable."
  },
  "why_api_why_own_api_key_desc2": {
    "message": "Our extension is designed with privacy in mind. All its logic and data reside on your side, meaning it needs to communicate directly with VirusTotal, without any middlemen. Your own API key ensures this direct, secure communication."
  },
  "api_key_title": {
    "message": "Enter VirusTotal API key"
  },
  "api_key_header": {
    "message": "Enter Your API Key"
  },
  "api_key_description": {
    "message": "Now that you have your VirusTotal API key, please enter it below:"
  },
  "api_key_secure_note": {
    "message": "Note: We do not share your API key with anyone. It is stored securely in your browser's local storage."
  },
  "api_key_invalid_key": {
    "message": "Invalid API key. Please check and try again."
  },
  "button_save": {
    "message": "Save"
  },
  "all_set": {
    "message": "All set!"
  },
  "all_set_description": {
    "message": "Your setup is complete. You can now enjoy safe browsing with VirusTotal Scanner."
  },
  "button_close": {
    "message": "Close"
  }
}
