{
  "blank": {
    "message": ""
  },
  "mute_warnings": {
    "message": "Isključi buduća upozorenja za ovu domenu"
  },
  "daily_quota_usage": {
    "message": "Dnevna kvota upotrebe"
  },
  "hourly_quota_usage": {
    "message": "Satna kvota upotrebe"
  },
  "setup_needed": {
    "message": "Potrebno podesiti postavke"
  },
  "no_api_key": {
    "message": "API ključ nije pronađen. Molimo unesite svoj VirusTotal API ključ na stranicama za postavljanje."
  },
  "go_to_setup": {
    "message": "Idi na postavke"
  },
  "overall_stats": {
    "message": "Ukupna statistika"
  },
  "safe": {
    "message": "Sigurno"
  },
  "info_safe": {
    "message": "Ova stranica je sigurna za posjetiti."
  },
  "malicious": {
    "message": "Zlonamjerno"
  },
  "status_site_not_scanned": {
    "message": "Stranica nije skenirana"
  },
  "info_no_active_tab": {
    "message": "Greška: Nema aktivne kartice"
  },
  "info_non_http": {
    "message": "Ova stranica neće biti skenirana jer se skeniraju samo javne domene koje koriste HTTP ili HTTPS protokol."
  },
  "status_loading": {
    "message": "Učitavanje..."
  },
  "status_warning": {
    "message": "Upozorenje!"
  },
  "info_warning": {
    "message": "$1 skenera je označilo ovu stranicu kao zlonamjernu."
  },
  "total_sites_scanned": {
    "message": "Ukupno skeniranih stranica: $1"
  },
  "dangerous_site_detected": {
    "message": "Otkrivena opasna stranica!"
  },
  "lead_warning": {
    "message": "Stranica $1 je označena kao potencijalno opasna od strane više izvora. Ne otkrivajte osobne podatke, podatke kreditnih kartica ili bilo koje druge osjetljive informacije. Postupajte oprezno."
  },
  "info_about_malicious": {
    "message": "Od $1 skenera, $2 smatraju ovu stranicu zlonamjernom."
  },
  "note_about_malicious": {
    "message": "Napomena: Oznaka \"zlonamjerno\" je najviša razina sigurnosti da bi stranica mogla biti štetna. Čak i jedan skener koji označava stranicu kao zlonamjernu trebao bi biti dovoljan za povećavanje mjera opreza. Uvijek budite oprezni i prioritetno razmišljajte o svojoj online sigurnosti."
  },
  "more_options": {
    "message": "Više opcija"
  },
  "mute_domain": {
    "message": "Zanemari buduća upozorenja za $1"
  },
  "understand_risk": {
    "message": "Razumijem rizik!"
  },
  "welcome_title": {
    "message": "Dobrodošli!"
  },
  "welcome_heading": {
    "message": "Dobrodošli u ScamAlert!"
  },
  "welcome_description": {
    "message": "ScamAlert je proširenje za Firefox koja provjerava URL-ove koje posjećujete u potrazi za zlonamjernim sadržajem. Koristi VirusTotal API za skeniranje domena i upozorava vas kada posjetite zlonamjerne domene."
  },
  "welcome_note": {
    "message": "<b>Napomena:</b> Iako proširenje koristi VirusTotal API, ScamAlert ni na kakav pravni način nije povezan s VirusTotal-om. Za dodatne uvijete korištenje VirusTotal API-ja provjerite službene VirusTotal stranice."
  },
  "welcome_instruction": {
    "message": "Za početak kliknite na gumb \"Dalje\" ispod."
  },
  "next": {
    "message": "Dalje"
  },
  "permissions_title": {
    "message": "Dozvole ekstenzije"
  },
  "permissions_heading": {
    "message": "Dozvole i privatnost"
  },
  "permissions_intro": {
    "message": "ScamAlert proširenje zahtijeva određene dozvole kako bi ispravno funkcioniralo. To su:"
  },
  "permission_active_tab": {
    "message": "<b>Pregled aktivne kartice:</b> Omogućuje interakciju s trenutno aktivnom karticom i skeniranje URL-ova za potencijalne prijetnje."
  },
  "permission_web_request": {
    "message": "<b>Pregled web zahtjeva:</b> Omogućuje praćenje web zahtjeva koje preglednik šalje, poput kada navigirate na novi URL. To je ključno za određivanje kada skenirati URL."
  },
  "permission_local_storage": {
    "message": "<b>Pristup lokalnoj pohrani:</b> Koristi se za pohranu postavki, API ključa i rezultata skeniranja radi bolje učinkovitosti i uštede API kvote."
  },
  "permission_unlimited_storage": {
    "message": "<b>Neograničena pohrana:</b> Proširenje može pohraniti neograničenu količinu podataka u pohrani preglednika. To osigurava da spremljeni rezultati skeniranja i postavke nisu slučajno izbrisani od strane preglednika kada oslobađa prostor."
  },
  "permission_alarms": {
    "message": "<b>Alarmi:</b> Omogućuju proširenju upravljanje i planiranje određenih zadataka unutar proširenja, poput čišćenja starih podataka o skeniranju ili dohvaćanja rezultata analize za domene."
  },
  "permission_host_permissions": {
    "message": "<b>Dozvole domaćina (host permissions):</b> Osigurava sposobnost skeniranja i analize sadržaja na svim web stranicama koje posjećujete."
  },
  "permissions_privacy_note": {
    "message": "Proširenje skenira samo domenski dio URL-a koji je zatim poslan isključivo VirusTotal-u. Vaša privatnost je naš najveći prioritet, zbog toga se svi vaši podatci vezani za proširenje nalaze isključivo na vašem računalu."
  },
  "permission_important_note_title": {
    "message": "Važno: Omogućavanje dozvole 'Pristup vašim podacima za sve web stranice'"
  },
  "permission_important_note_intro": {
    "message": "Ovo proširenje zahtjeva dozvolu 'Pristup vašim podacima za sve web stranicame' kako bi ispravno funkcioniralo. Odobravanje ove dozvole omogućava proširenju uvid u URL-ove koje posjećujuete, što je ključno za analiziranje domena. Bez odobravanja navedene dozvole proširenje ne može raditi."
  },
  "permission_important_note_guide": {
    "message": "Ispod su opisani koraci za odobravanje dozvole:"
  },
  "permission_important_note_step1": {
    "message": "Desni klik na ikonu proširenja u vašoj alatnoj traci preglednika."
  },
  "permission_important_note_step2": {
    "message": "Odaberite 'Upravljaj proširenjem' iz kontekstnog izbornika koji se pojavi."
  },
  "permission_important_note_step3": {
    "message": "Na novoj stranici, kliknite na karticu 'Dozvole'."
  },
  "permission_important_note_step4": {
    "message": "Pronađite dozvolu 'Pristupi tvojim podacima za sve web stranice' i omogućite je klikom na gumb pored nje."
  },
  "permission_grant_error": {
    "message": "Proširenje ne može raditi bez dozvole 'Prostup vašim podacima za sve web stranice'. Molimo vas da odobrite dozvolu prije nastavljanja."
  },
  "why_api_title": {
    "message": "Zašto vam je potreban VirusTotal API ključ?"
  },
  "why_api_header": {
    "message": "Zašto API ključ?"
  },
  "why_api_description": {
    "message": "Da bismo analizirali URL-ove i osigurali vašu sigurnost, naše proširenje oslanja se na uslugu VirusTotal..."
  },
  "why_api_free_no_credit_card": {
    "message": "Ne brinite, potpuno je besplatno, nije potrebna kreditna kartica niti bilo kakvi osjetljivi podaci."
  },
  "why_api_steps": {
    "message": "Koraci za dobivanje vašeg API ključa"
  },
  "why_api_steps_step1": {
    "message": "Registrirajte se za besplatan račun na <a href='https://www.virustotal.com/gui/join-us' target='_blank'>VirusTotal</a>."
  },
  "why_api_steps_step2": {
    "message": "Nakon registracije, idite na odjeljak s vašim API ključem ili koristite poveznicu <b>www.virustotal.com/gui/user/USERNAME/apikey</b> i zamijenite <b>USERNAME</b> s korisničkim imenom VirusTotal računa koji ste registrirali u prethodnom koraku."
  },
  "why_api_steps_step3": {
    "message": "Na VirusTotal stranici, kliknite na gumb 'Kopiraj API ključ' ili 'Copy API key' da kopirate API ključ u međuspremnik. Nakon što ste kopirali ključ vratite se na ovu stranicu i prijeđite na iduću klikom na gumb 'Dalje'."
  },
  "why_api_image_guide_intro": {
    "message": "Alternativno, potražite VirusTotal u pretraživaču, registrirajte se za račun i slijedite slikovni vodič koji se nalazi ispod."
  },
  "why_api_image_guide_header": {
    "message": "Slikovni vodič za pristup API ključu"
  },
  "why_api_image_guide_img1_desc": {
    "message": "Ova slika pokazuje gdje se nalazi odjeljak API ključa vašeg VirusTotal računa."
  },
  "why_api_image_guide_img2_desc": {
    "message": "Ova slika pokazuje gdje kliknuti da kopirate API ključ u međuspremnik."
  },
  "why_api_what_is_api_header": {
    "message": "Što je API ključ i zašto vam je potreban?"
  },
  "why_api_what_is_api_desc": {
    "message": "API ključ je kao tajna lozinka koja proširenju omogućava komunikaciju s VirusTotal poslužiteljima. Koristeći API ključ proširenje se autentificira u VirusTotal i time dobiva mogućnost korištenja usluge skeniranja domena."
  },
  "why_api_why_own_api_key_header": {
    "message": "Zašto vam je potreban vlastiti API ključ?"
  },
  "why_api_why_own_api_key_desc1": {
    "message": "Svaki API ključ ima ograničenu kvotu za zahtjeve prema VirusTotalu. Dijeljenje jednog ključa između svih korisnika brzo bi iscrpilo ovo ograničenje, čineći uslugu nedostupnom."
  },
  "why_api_why_own_api_key_desc2": {
    "message": "Naše je proširenje dizajnirano s privatnosti na umu. Sva logika i podaci nalaze se na vašoj strani, što znači da treba izravno komunicirati s VirusTotalom, bez posrednika. Vaš vlastiti API ključ osigurava ovu izravnu, sigurnu komunikaciju."
  },
  "api_key_title": {
    "message": "Unesite VirusTotal API ključ"
  },
  "api_key_header": {
    "message": "Unesite svoj API ključ"
  },
  "api_key_description": {
    "message": "Sada kada imate svoj VirusTotal API ključ, molimo vas da ga unesete ispod:"
  },
  "api_key_secure_note": {
    "message": "Napomena: Ne dijelimo vaš API ključ ni s kim. Spremljen je sigurno u lokalnoj pohrani vašeg preglednika."
  },
  "api_key_invalid_key": {
    "message": "Neispravan API ključ. Molimo probajte ponovno."
  },
  "button_save": {
    "message": "Spremi"
  },
  "all_set": {
    "message": "Sve je spremno!"
  },
  "all_set_description": {
    "message": "Postavljanje prošitenja je završeno. Sada možete uživati u sigurnom surfanju internetom."
  },
  "button_close": {
    "message": "Zatvori"
  }
}
